import streamlit as st
import pandas as pd

#标题
st.title("瓦煲粉😋")
# 分割线
st.markdown('***')

#章节
st.header(" :blue[*瓦煲粉菜品*]")

#子章节1
st.subheader("瓦煲鲜肉粉")
#描述1
st.markdown(":green[瓦煲滚汤，鲜肉秒涮，薄嫩锁汁，骨汤鲜甜，粉滑吸味，端上桌咕嘟冒泡，一口下去，暖到胃里。]")
#子章节2
st.subheader("瓦煲猪杂粉")
#描述2
st.markdown(":green[猪肝、粉肠、猪红齐聚瓦煲，番茄炒红油，骨汤兜底，咕嘟间脆变嫩，酸胡椒点睛，汤浓肉香，双筷捞光。]")
#子章节3
st.subheader("瓦煲老友粉")
#描述3
st.markdown(":green[先爆豆豉酸笋，再冲老火骨汤，酸辣鲜“嘭”地炸开，指天椒提劲，番茄回甘，猪杂脆嫩，嗦粉冒汗，南宁灵魂醒神。]")
# 分割线
st.markdown('***')

#章节2
st.header(" :blue[*菜品选择占比*]")
c1,c2,c3=st.columns(3)
c1.metric(label="瓦煲鲜肉粉", value="40%", delta="-5%")
c2.metric(label="瓦煲猪杂粉", value="30%", delta="6%")
c3.metric(label="瓦煲老友粉", value="30%", delta="-2%")
# 分割线
st.markdown('***')

#章节3
st.header(' :blue[*今日客流量情况*]')
st.metric(label="今日到访人数", value="228", delta="10", label_visibility='hidden')
# 分割线
st.markdown('***')

#章节4
st.header(" :blue[*瓦煲粉菜单*]")
data = {
    '今日已售':[89, 67, 72],
    '可加配料':['葱花，香菜，酸菜，小米辣', '葱花，香菜，酸菜，小米辣', '葱花，香菜，酸菜，小米辣'],
    '价格':[10, 10, 12],
}

index = pd.Series(['瓦煲鲜肉粉', '瓦煲猪杂粉', '瓦煲老友粉' ], name='名称')
df = pd.DataFrame(data, index=index)
st.dataframe(df)
# 分割线
st.markdown('***')

#章节5
st.header(' :blue[*Python代码块*]')

python_code = '''def hello():
print("
st.header(" :blue[*菜品选择占比*]")
c1,c2,c3=st.columns(3)
c1.metric(label="瓦煲鲜肉粉", value="40%", delta="-5%")
c2.metric(label="瓦煲猪杂粉", value="30%", delta="6%")
c3.metric(label="瓦煲老友粉", value="30%", delta="-2%")
")
'''

# 斜体说明文字样式
st.caption('<i>显示的是菜品占比的Python代码块内容</i>', unsafe_allow_html=True)
st.code(python_code)

st.text('''欢迎大家来品尝！
2025-12-11''')
